app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    @group.users << current_user
---
INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (19, 2, '2019-03-29 10:29:01', '2019-03-29 10:29:01')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('テスト', '2019-03-27 06:07:13', '2019-03-27 06:07:13')