app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
    respond_to do |format|
      format.json { @new_messages = @messages.where('id > ?', params[:message][:id]) }

INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('おんとう 喜劇 すいせん 犠牲。', 15, 13, '2019-03-12 12:03:00', '2019-03-12 12:03:00', NULL)
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save